{
    "how do i reset my password": "Go to the login page and click 'Forgot Password' to receive reset instructions by email.",
    "do you accept international credit cards": "Yes, we accept major international credit cards including Visa, Mastercard, and Amex.",
    "what's your return policy": "Returns are accepted within 30 days of purchase with the original packaging and receipt.",
    "can i change the delivery address": "Delivery addresses can only be changed before the order is shipped. Contact support as soon as possible.",
    "do you offer curbside pickup": "Yes, curbside pickup is available at select store locations. Choose this option at checkout.",
    "how do i leave a product review": "Log into your account, go to 'My Purchases', and click on 'Leave a Review' for the product.",
    "what payment methods do you accept": "We accept credit/debit cards, PayPal, Apple Pay, and store credit.",
    "can i use multiple promo codes": "Only one promo code can be applied per order unless stated otherwise.",
    "is gift wrapping available": "Yes, gift wrapping is available for a small fee. You can select this option during checkout.",
    "how do i join the mailing list": "Scroll to the bottom of our homepage and enter your email under 'Subscribe to Our Newsletter'.",
    "do you ship to po boxes": "Yes, we ship to PO boxes via standard delivery. Expedited options may not be available.",
    "how do i update my account information": "Log into your account and go to 'Account Settings' to update your information.",
    "is there a mobile app": "Yes, our mobile app is available on iOS and Android. Search our brand name to download.",
    "do you offer eco-friendly packaging": "Yes, we offer eco-friendly packaging on most items. You can opt in during checkout.",
    "how do i opt out of marketing emails": "Click 'Unsubscribe' at the bottom of any marketing email or update preferences in your account.",
    "what's your privacy policy": "Our privacy policy can be viewed at the bottom of our homepage under 'Privacy'.",
    "can i pay in installments": "Yes, we offer installment plans through Klarna and Affirm at checkout.",
    "how long do refunds take": "Refunds typically take 5–7 business days to appear on your original payment method.",
    "do you have a wishlist feature": "Yes, you can add items to your wishlist by clicking the heart icon on the product page.",
    "can i place an order over the phone": "Yes, phone orders are available during business hours through our sales team.",
    "do you offer free returns": "Yes, we offer free returns on eligible items within 30 days of purchase.",
    "can i exchange a gift": "Yes, gifts can be exchanged for store credit or another item. Proof of purchase may be required.",
    "where do ye deliver yer plunder": "We deliver across the seven seas—aka all 50 states and most international ports.",
    "any special loot discounts today": "Check the 'Daily Spoils' on our homepage for limited-time deals and pirate promos.",
    "can i buy gift doubloons": "Aye, ye can purchase digital gift doubloons from $25 to $500 on our site.",
    "when will ye restock the black tricorn": "Popular loot gets restocked weekly. Sign up for alerts on the product page.",
    "do ye have physical outposts": "Aye, we’ve got flagship stores in key pirate ports like Tampa, San Diego, and Charleston.",
    "help settin’ up me talking parrot": "Setup scrolls be online under 'Parrot Companions'. Want us to send ye the link?",
    "what are yer delivery methods": "We offer Standard (5–7 days), Express (2–3 days), and Overnight Ship Cannon Speed delivery.",
    "can i add more loot to me order": "Once yer order sets sail, no changes can be made. Place a new order for extra loot.",
    "can ye explain a mysterious charge": "Send us yer order ID or the last 4 digits of yer doubloon card to investigate.",
    "do ye offer student buccaneer discounts": "Aye, students get 10% off. Verify yer academy credentials to claim the offer.",
    "what warranties do ye offer": "All items come with a 1-year pirate warranty. Extended protection up to 3 years be available.",
    "do ye offer bulk treasure pricing": "Aye, orders of 5 or more of the same item earn discounts. Contact sales for quotes.",
    "what chargers work with me enchanted lantern": "Tell us the lantern model and we’ll list compatible charging scrolls and stones.",
    "can i schedule delivery after i dock": "Aye, Premium Delivery lets ye pick a delivery time window for a few extra gold pieces.",
    "do ye charge a restockin’ fee": "No fee for returns within 30 days. After that, a 15% restocking toll may apply.",
    "can i get an invoice fer me pirate business": "Aye, send us yer business info and order number to get an official trade receipt.",
    "do ye run a rewards program": "Aye, one gold coin per dollar spent. Redeem ‘em for discounts or pirate perks.",
    "when do seasonal wares arrive": "Holiday and seasonal stock arrives 4–6 weeks before major events like Talk Like a Pirate Day."
}